# EXTRACT

In [146]:
# Import dependencies
import pandas as pd
import requests 
import json
from pprint import pprint
import numpy as np
from sqlalchemy import create_engine
from config import connection_string
import warnings
warnings.filterwarnings("ignore")

In [147]:
# Read csv and json data
prices_df= pd.read_csv('Resources/prices.csv')
sales_aug_df= pd.read_csv('Resources/sales_aug.csv')
walmart_df=pd.read_json('Resources/walmart.json')
us_state= pd.read_csv('Resources/US_states.csv')

In [148]:
# Display walmart(json)
walmart_df.head()

,id,storeType,timeZone,openDate,name,postalCode,address1,city,state,country,latitude,longitude,phone_number
0,6601,3,K,01/04/1994 12:00,Sam's Club,99515,8801 Old Seward Hwy,Anchorage,AK,US,61.140770,-149.860016,(907) 522-2333
1,6602,3,K,01/06/1994 12:00,Sam's Club,99504,1074 N. Muldoon Road,Anchorage,AK,US,61.231079,-149.740844,(907) 276-2996
2,2074,1,K,03/29/1994 12:00,Walmart Supercenter,99654,1350 S Seward Meridian Pkwy,Wasilla,AK,US,61.568752,-149.363647,(907) 376-9780
3,2070,1,K,03/29/1994 12:00,Walmart Supercenter,99503,3101 A St,Anchorage,AK,US,61.192337,-149.880356,(907) 563-5900
4,6603,3,K,01/08/1994 12:00,Sam's Club,99701,48 College Rd,Fairbanks,AK,US,64.852867,-147.707336,(907) 451-4800

In [149]:
# Display sales_aug(csv)
sales_aug_df.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1937,d_1938,d_1939,d_1940,d_1941,sales1,sales2,start,scale1,scale2
0,HOBBIES_1_001_CA_1,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,3,3,0,1,1.097306e-05,0.000013,902,0.757426,0.773603
1,HOBBIES_1_002_CA_1,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,0,0,8.128193e-07,0.000003,144,0.424208,0.422049
2,HOBBIES_1_003_CA_1,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,2,3,0,1,6.502554e-06,0.000008,1106,0.492556,0.511990
3,HOBBIES_1_004_CA_1,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,3,0,2,6,2.072689e-05,0.000019,37,1.779200,1.778245
4,HOBBIES_1_005_CA_1,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,2,1,0,1.544357e-05,0.000015,113,1.101723,1.102354

In [150]:
# Dispaly Prices (csv) 
prices_df.head()

,id,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,d_9,...,d_1960,d_1961,d_1962,d_1963,d_1964,d_1965,d_1966,d_1967,d_1968,d_1969
0,FOODS_1_001_CA_1,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24
1,FOODS_1_001_CA_2,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24
2,FOODS_1_001_CA_3,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24
3,FOODS_1_001_CA_4,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24
4,FOODS_1_001_TX_1,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24

In [151]:
us_state.head()

    ID STATE
0  1.0    AL
1  2.0    AK
2  4.0    AZ
3  5.0    AR
4  6.0    CA

# TRANSFORM

In [152]:
# Filtering to show just walmart Supercenter data
walmart_df = walmart_df[walmart_df.storeType.eq(1)]
walmart_df

,id,storeType,timeZone,openDate,name,postalCode,address1,city,state,country,latitude,longitude,phone_number
2,2074,1,K,03/29/1994 12:00,Walmart Supercenter,99654,1350 S Seward Meridian Pkwy,Wasilla,AK,US,61.568752,-149.363647,(907) 376-9780
3,2070,1,K,03/29/1994 12:00,Walmart Supercenter,99503,3101 A St,Anchorage,AK,US,61.192337,-149.880356,(907) 563-5900
5,2071,1,K,03/29/1994 12:00,Walmart Supercenter,99515,8900 Old Seward Hwy,Anchorage,AK,US,61.140263,-149.868835,(907) 344-5300
6,2188,1,K,04/26/2000 12:00,Walmart Supercenter,99577,18600 Eagle River Rd,Eagle River,AK,US,61.309483,-149.534912,(907) 694-9780
7,3814,1,K,09/12/2007 12:00,Walmart Supercenter,99801,6525 Glacier Hwy,Juneau,AK,US,58.358349,-134.514862,(907) 789-5000
...,...,...,...,...,...,...,...,...,...,...,...,...,...
5815,1456,1,MST,08/01/1990 12:00,Walmart Supercenter,82930,125 N 2Nd St,Evanston,WY,US,41.265720,-110.954559,(307) 789-0010
5816,1485,1,MST,01/30/1991 12:00,Walmart Supercenter,82718,2300 S Douglas Hwy,Gillette,WY,US,44.273472,-105.494208,(307) 686-4060
5817,1457,1,MST,06/27/1990 12:00,Walmart Supercenter,82501,1733 N Federal Blvd,Riverton,WY,US,43.042599,-108.379036,(307) 856-3261
5818,1778,1,MST,04/01/1992 12:00,Walmart Supercenter,82414,321 Yellowstone Ave,Cody,WY,US,44.517460,-109.089333,(307) 527-4673
5820,1617,1,MST,12/31/1991 12:00,Walmart Supercenter,82609,4400 E 2Nd St,Casper,WY,US,42.849002,-106.269392,(307) 237-0991

In [153]:
# Data types of the datafram and number, and percentage of NAN values (walmart):
def missing_data(data):
    total = data.isnull().sum()
    percent = (data.isnull().sum()/data.isnull().count()*100)
    missing_values = pd.concat([total, percent], axis=1, keys=['Total', 'Percent'])
    types = []
    #Convert to string and add to list
    for col in data.columns: 
        dtype = str(data[col].dtype)
        types.append(dtype)
    missing_values['Types'] = types
    return(np.transpose(missing_values))

# Run function:
missing_data(walmart_df)

,id,storeType,timeZone,openDate,name,postalCode,address1,city,state,country,latitude,longitude,phone_number
Total,0,0,0,0,0,0,0,0,0,0,0,0,0
Percent,0,0,0,0,0,0,0,0,0,0,0,0,0
Types,int64,int64,object,object,object,int64,object,object,object,object,float64,float64,object

In [154]:
# Data types of the datafram and number, and percentage of NAN values (sales_aug):
missing_data(sales_aug_df)

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1937,d_1938,d_1939,d_1940,d_1941,sales1,sales2,start,scale1,scale2
Total,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Percent,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Types,object,object,object,object,object,object,int64,int64,int64,int64,...,int64,int64,int64,int64,int64,float64,float64,int64,float64,float64

In [155]:
# Data types of the datafram and number, and percentage of NAN values (prices):
missing_data(prices_df)

,id,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,d_9,...,d_1960,d_1961,d_1962,d_1963,d_1964,d_1965,d_1966,d_1967,d_1968,d_1969
Total,0,19558,19558,19558,19558,19558,19558,19558,18515,18515,...,0,0,0,0,0,0,0,0,0,0
Percent,0,64.1456,64.1456,64.1456,64.1456,64.1456,64.1456,64.1456,60.7248,60.7248,...,0,0,0,0,0,0,0,0,0,0
Types,object,float64,float64,float64,float64,float64,float64,float64,float64,float64,...,float64,float64,float64,float64,float64,float64,float64,float64,float64,float64

In [156]:
# Drop NAN values of prices
prices_df = prices_df.dropna()
missing_data(prices_df)

,id,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,d_9,...,d_1960,d_1961,d_1962,d_1963,d_1964,d_1965,d_1966,d_1967,d_1968,d_1969
Total,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Percent,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Types,object,float64,float64,float64,float64,float64,float64,float64,float64,float64,...,float64,float64,float64,float64,float64,float64,float64,float64,float64,float64

In [157]:
# Merge walmart_df with us_state to incluse ID for states:
walmart_df.rename(columns={"state":"STATE"}, inplace=True)
walmart=walmart_df.merge(us_state, on="STATE", how="inner")
walmart.head()

,id,storeType,timeZone,openDate,name,postalCode,address1,city,STATE,country,latitude,longitude,phone_number,ID
0,2074,1,K,03/29/1994 12:00,Walmart Supercenter,99654,1350 S Seward Meridian Pkwy,Wasilla,AK,US,61.568752,-149.363647,(907) 376-9780,2.0
1,2070,1,K,03/29/1994 12:00,Walmart Supercenter,99503,3101 A St,Anchorage,AK,US,61.192337,-149.880356,(907) 563-5900,2.0
2,2071,1,K,03/29/1994 12:00,Walmart Supercenter,99515,8900 Old Seward Hwy,Anchorage,AK,US,61.140263,-149.868835,(907) 344-5300,2.0
3,2188,1,K,04/26/2000 12:00,Walmart Supercenter,99577,18600 Eagle River Rd,Eagle River,AK,US,61.309483,-149.534912,(907) 694-9780,2.0
4,3814,1,K,09/12/2007 12:00,Walmart Supercenter,99801,6525 Glacier Hwy,Juneau,AK,US,58.358349,-134.514862,(907) 789-5000,2.0

In [158]:
# Merge sales_aug_df with us_state to incluse ID for states:
sales_aug_df.rename(columns={"state_id":"STATE"}, inplace=True)
sales_aug=sales_aug_df.merge(us_state, on="STATE", how="inner")
sales_aug.head()

,id,item_id,dept_id,cat_id,store_id,STATE,d_1,d_2,d_3,d_4,...,d_1938,d_1939,d_1940,d_1941,sales1,sales2,start,scale1,scale2,ID
0,HOBBIES_1_001_CA_1,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,3,3,0,1,1.097306e-05,0.000013,902,0.757426,0.773603,6.0
1,HOBBIES_1_002_CA_1,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,0,8.128193e-07,0.000003,144,0.424208,0.422049,6.0
2,HOBBIES_1_003_CA_1,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,3,0,1,6.502554e-06,0.000008,1106,0.492556,0.511990,6.0
3,HOBBIES_1_004_CA_1,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,3,0,2,6,2.072689e-05,0.000019,37,1.779200,1.778245,6.0
4,HOBBIES_1_005_CA_1,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,2,1,0,1.544357e-05,0.000015,113,1.101723,1.102354,6.0

In [159]:
# Adding all the day columns in sales_aug to get a sum of quantity column for days:
cols_to_keep=[col for col in sales_aug.columns if col.startswith('d_')==False]
cols_to_sum=[col for col in sales_aug.columns if col.startswith('d_')]
sum_df=sales_aug[cols_to_sum].sum(axis=1)
sum_df=pd.DataFrame(sum_df, columns=['Sum Quantity'])

keep_df=sales_aug[cols_to_keep]


finalsales=keep_df.join(sum_df)

# Rename state_id to state
finalsales.rename(columns={"id":"item_cat_id"}, inplace=True)
Columns=["item_cat_id", "item_id", "dept_id", "cat_id", "store_id", "STATE","ID", "Sum Quantity"]
finalsales_df=finalsales[Columns]
finalsales_df

,item_cat_id,item_id,dept_id,cat_id,store_id,STATE,ID,Sum Quantity
0,HOBBIES_1_001_CA_1,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,6.0,633
1,HOBBIES_1_002_CA_1,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,6.0,500
2,HOBBIES_1_003_CA_1,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,6.0,309
3,HOBBIES_1_004_CA_1,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,6.0,3337
4,HOBBIES_1_005_CA_1,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,6.0,1888
...,...,...,...,...,...,...,...,...
39775,WI_HOUSEHOLD,HOUSEHOLD,HOUSEHOLD,HOUSEHOLD,WI,WI,55.0,3766654
39776,WI_1_X,X,X,X,WI_1,WI,55.0,5261506
39777,WI_2_X,X,X,X,WI_2,WI,55.0,6697988
39778,WI_3_X,X,X,X,WI_3,WI,55.0,6542557
39779,WI_X,X,X,X,WI,WI,55.0,18502051

In [160]:
# Adding all the day columns in prices to get an average price column for days:
column_to_keep=[col for col in prices.columns if col.startswith('d_')==False]
column_to_avg=[col for col in prices.columns if col.startswith('d_')]
avg_df=prices[column_to_avg].mean(axis=1)
avg_df=pd.DataFrame(avg_df, columns=['Avg Prices'])

keeps_df=prices[column_to_keep]

finalprices_df=keeps_df.join(avg_df)
finalprices_df = finalprices_df.round({'Avg Prices': 3})
finalprices_df.rename(columns={"id":"item_cat_id"}, inplace=True)
finalprices_df

                item_cat_id  Avg Prices
0          FOODS_1_001_CA_1       2.169
1          FOODS_1_001_CA_2       2.169
2          FOODS_1_001_CA_3       2.158
3          FOODS_1_001_CA_4       2.169
4          FOODS_1_001_TX_1       2.157
...                     ...         ...
30485  HOUSEHOLD_2_516_TX_2       5.922
30486  HOUSEHOLD_2_516_TX_3       5.922
30487  HOUSEHOLD_2_516_WI_1       5.940
30488  HOUSEHOLD_2_516_WI_2       5.940
30489  HOUSEHOLD_2_516_WI_3       5.940

[30490 rows x 2 columns]

In [161]:
# Merging finalprices_df with finalsales_df  
merged_df=finalprices_df.merge(finalsales_df, on="item_cat_id", how="inner")
merged_df

,item_cat_id,Avg Prices,item_id,dept_id,cat_id,store_id,STATE,ID,Sum Quantity
0,FOODS_1_001_CA_1,2.169,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,6.0,1526
1,FOODS_1_001_CA_2,2.169,FOODS_1_001,FOODS_1,FOODS,CA_2,CA,6.0,2232
2,FOODS_1_001_CA_3,2.158,FOODS_1_001,FOODS_1,FOODS,CA_3,CA,6.0,2329
3,FOODS_1_001_CA_4,2.169,FOODS_1_001,FOODS_1,FOODS,CA_4,CA,6.0,694
4,FOODS_1_001_TX_1,2.157,FOODS_1_001,FOODS_1,FOODS,TX_1,TX,48.0,1145
...,...,...,...,...,...,...,...,...,...
30485,HOUSEHOLD_2_516_TX_2,5.922,HOUSEHOLD_2_516,HOUSEHOLD_2,HOUSEHOLD,TX_2,TX,48.0,485
30486,HOUSEHOLD_2_516_TX_3,5.922,HOUSEHOLD_2_516,HOUSEHOLD_2,HOUSEHOLD,TX_3,TX,48.0,243
30487,HOUSEHOLD_2_516_WI_1,5.940,HOUSEHOLD_2_516,HOUSEHOLD_2,HOUSEHOLD,WI_1,WI,55.0,171
30488,HOUSEHOLD_2_516_WI_2,5.940,HOUSEHOLD_2_516,HOUSEHOLD_2,HOUSEHOLD,WI_2,WI,55.0,64
30489,HOUSEHOLD_2_516_WI_3,5.940,HOUSEHOLD_2_516,HOUSEHOLD_2,HOUSEHOLD,WI_3,WI,55.0,247

In [162]:
#Total quantity and average prices for each category in the discussed states(CA, TX, WI) 
merged_groupby=merged_df.groupby(["ID","STATE", "cat_id"])
state_category = pd.DataFrame(merged_groupby.agg({'Sum Quantity': 'sum', 'Avg Prices': 'mean'}).reset_index())
state_category = state_category.round({'Avg Prices': 3})
state_category

     ID STATE     cat_id  Sum Quantity  Avg Prices
0   6.0    CA      FOODS      19535863       3.295
1   6.0    CA    HOBBIES       3095587       5.571
2   6.0    CA  HOUSEHOLD       6565267       5.445
3  48.0    TX      FOODS      13172106       3.257
4  48.0    TX    HOBBIES       1624130       5.515
5  48.0    TX  HOUSEHOLD       4432169       5.434
6  55.0    WI      FOODS      13214458       3.330
7  55.0    WI    HOBBIES       1520939       5.578
8  55.0    WI  HOUSEHOLD       3766654       5.454

In [186]:
state_category.columns

Index(['ID', 'STATE', 'cat_id', 'Sum Quantity', 'Avg Prices'], dtype='object')

In [163]:
# Calculate count of stores in each state
walmart_stores=pd.DataFrame(walmart.groupby(["ID", "STATE"]).size())
walmart_stores.reset_index(inplace=True)
walmart_stores.rename(columns={0:"total stores"}, inplace=True)
walmart_stores.head()

    ID STATE  total stores
0  1.0    AL            93
1  2.0    AK             7
2  4.0    AZ            74
3  5.0    AR            69
4  6.0    CA            85

In [166]:
# Total quantity and average prices for each category and count of stores in each discussed state(CA, TX, WI)
walmart_state_cat = state_category.merge(walmart_stores, on=["ID","STATE"], how="inner")
walmart_state_cat

     ID STATE     cat_id  Sum Quantity  Avg Prices  total stores
0   6.0    CA      FOODS      19535863       3.295            85
1   6.0    CA    HOBBIES       3095587       5.571            85
2   6.0    CA  HOUSEHOLD       6565267       5.445            85
3  48.0    TX      FOODS      13172106       3.257           327
4  48.0    TX    HOBBIES       1624130       5.515           327
5  48.0    TX  HOUSEHOLD       4432169       5.434           327
6  55.0    WI      FOODS      13214458       3.330            72
7  55.0    WI    HOBBIES       1520939       5.578            72
8  55.0    WI  HOUSEHOLD       3766654       5.454            72

In [168]:
# Total quantity and average prices and count of stores in each discussed state(CA, TX, WI)
merge_group=merged_df.groupby(["ID","STATE"])
state_sale = pd.DataFrame(merge_group.agg({'Sum Quantity': 'sum', 'Avg Prices': 'mean'}).reset_index())
state_sale
state_store_sale=state_sale.merge(walmart_stores, on=["ID","STATE"], how="inner")
state_store_sale

     ID STATE  Sum Quantity  Avg Prices  total stores
0   6.0    CA      29196717    4.455004            85
1  48.0    TX      19228405    4.423214           327
2  55.0    WI      18502051    4.475655            72

In [169]:
# create CAfoods dataframe 
CAfoods = merged_df.loc[(merged_df["cat_id"]=='FOODS') & (merged_df["STATE"]=="CA"),:]
CAfoods

,item_cat_id,Avg Prices,item_id,dept_id,cat_id,store_id,STATE,ID,Sum Quantity
0,FOODS_1_001_CA_1,2.169,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,6.0,1526
1,FOODS_1_001_CA_2,2.169,FOODS_1_001,FOODS_1,FOODS,CA_2,CA,6.0,2232
2,FOODS_1_001_CA_3,2.158,FOODS_1_001,FOODS_1,FOODS,CA_3,CA,6.0,2329
3,FOODS_1_001_CA_4,2.169,FOODS_1_001,FOODS_1,FOODS,CA_4,CA,6.0,694
10,FOODS_1_002_CA_1,8.936,FOODS_1_002,FOODS_1,FOODS,CA_1,CA,6.0,934
...,...,...,...,...,...,...,...,...,...
14353,FOODS_3_826_CA_4,1.280,FOODS_3_826,FOODS_3,FOODS,CA_4,CA,6.0,1893
14360,FOODS_3_827_CA_1,1.000,FOODS_3_827,FOODS_3,FOODS,CA_1,CA,6.0,1684
14361,FOODS_3_827_CA_2,1.000,FOODS_3_827,FOODS_3,FOODS,CA_2,CA,6.0,1099
14362,FOODS_3_827_CA_3,1.000,FOODS_3_827,FOODS_3,FOODS,CA_3,CA,6.0,2703
14363,FOODS_3_827_CA_4,1.000,FOODS_3_827,FOODS_3,FOODS,CA_4,CA,6.0,189

# LOAD

In [170]:
# Create engine
engine=create_engine(f"postgresql://{connection_string}")

In [173]:
# Create table state_category and add data 
state_category.to_sql(name="state_category", con=engine, if_exists='append', index=True)

In [174]:
# Create table walmart_stores and add data 
walmart_stores.to_sql(name="walmart_stores", con=engine, if_exists='append', index=True)

In [175]:
# Create table walmart_state_cat and add data 
walmart_state_cat.to_sql(name="walmart_state_cat", con=engine, if_exists='append', index=True)

In [176]:
## Create table state_store_sale and add data 
state_store_sale.to_sql(name="state_store_sale", con=engine, if_exists='append', index=True)

In [177]:
# Check table names in database
engine.table_names()

['d7_cat_lvl6',
 'd3_categories',
 'd3_departments',
 'd3_stores',
 'd3_quant_fe',
 'd3_sales',
 'CAfoods',
 'state_category',
 'walmart_stores',
 'walmart_state_cat',
 'd3_prices',
 'spatial_ref_sys',
 'd7_prod_cat',
 'd7_cat_lvl1',
 'd7_cat_lvl2',
 'revenue',
 'net_income',
 'operating_income',
 'shares',
 'earnings',
 'd7_cat_lvl3',
 'd7_cat_lvl4',
 'd7_cat_lvl5',
 'state_store_sale']

In [183]:
engine.execute('SELECT * FROM "state_category"').fetchall()

[(0, 6.0, 'CA', 'FOODS', 19535863, 3.295),
 (1, 6.0, 'CA', 'HOBBIES', 3095587, 5.571),
 (2, 6.0, 'CA', 'HOUSEHOLD', 6565267, 5.445),
 (3, 48.0, 'TX', 'FOODS', 13172106, 3.257),
 (4, 48.0, 'TX', 'HOBBIES', 1624130, 5.515),
 (5, 48.0, 'TX', 'HOUSEHOLD', 4432169, 5.434),
 (6, 55.0, 'WI', 'FOODS', 13214458, 3.33),
 (7, 55.0, 'WI', 'HOBBIES', 1520939, 5.578),
 (8, 55.0, 'WI', 'HOUSEHOLD', 3766654, 5.454)]

In [187]:
# Add primary key constraint to table state_category
engine.execute('ALTER TABLE "state_category" ADD PRIMARY KEY ("STATE", "cat_id")')

In [188]:
# Add primary key constraint to table walmart_stores
engine.execute('ALTER TABLE walmart_stores ADD PRIMARY KEY ("ID")')

In [189]:
# Add primary key constraint to table walmart_state_cat
engine.execute('ALTER TABLE walmart_state_cat ADD PRIMARY KEY ("STATE", "cat_id")')

In [190]:
# Add primary key constraint to table state_store_sale
engine.execute('ALTER TABLE state_store_sale ADD PRIMARY KEY ("ID")')